In [2]:
import numpy as np
np.multiply.reduce([2,3,5])

30

In [3]:
np.add.accumulate([2,3,5])

array([ 2,  5, 10], dtype=int32)

In [4]:
np.multiply.accumulate([2,3,5])

array([ 2,  6, 30], dtype=int32)

In [5]:
a = np.array([[1,2,3],[4,5,6]])
a
np.cumsum(a)

array([ 1,  3,  6, 10, 15, 21], dtype=int32)

In [8]:
import numpy as np
import pandas as pd

pd.__version__

'1.4.2'

In [9]:
arr = np.random.standard_normal((10,5))
arr

array([[ 0.28284548,  0.77721094, -0.98611344, -0.97015253,  2.02204424],
       [-0.211832  , -0.28928617,  0.85012025, -0.51684931, -1.40014556],
       [-1.41404033, -0.23665267,  0.2543469 ,  1.16599743,  0.64117122],
       [-0.08082465, -0.34434485, -0.32613583,  2.16125327, -0.65586736],
       [ 1.16464976, -0.39023376,  0.46336618,  0.9661958 ,  0.71690988],
       [ 0.94232211, -0.78652426, -0.41317265, -0.58959166,  0.62646549],
       [-0.26375547, -0.39156369,  1.21679199,  0.33405529, -1.28664203],
       [ 0.90506241, -2.19000894,  1.00164636,  0.27251471,  0.15726373],
       [-0.82240694,  0.16906367, -0.37492357,  1.44599875, -1.40868244],
       [-0.29552546,  0.69714204,  2.56409986, -0.05468872,  0.84337869]])

In [10]:
df = pd.DataFrame(arr)
df

          0         1         2         3         4
0  0.282845  0.777211 -0.986113 -0.970153  2.022044
1 -0.211832 -0.289286  0.850120 -0.516849 -1.400146
2 -1.414040 -0.236653  0.254347  1.165997  0.641171
3 -0.080825 -0.344345 -0.326136  2.161253 -0.655867
4  1.164650 -0.390234  0.463366  0.966196  0.716910
5  0.942322 -0.786524 -0.413173 -0.589592  0.626465
6 -0.263755 -0.391564  1.216792  0.334055 -1.286642
7  0.905062 -2.190009  1.001646  0.272515  0.157264
8 -0.822407  0.169064 -0.374924  1.445999 -1.408682
9 -0.295525  0.697142  2.564100 -0.054689  0.843379

In [11]:
#df.head() it gives 5, first rows
df.head(2)

          0         1         2         3         4
0  0.282845  0.777211 -0.986113 -0.970153  2.022044
1 -0.211832 -0.289286  0.850120 -0.516849 -1.400146

In [12]:
#df.tail() it gives last 5 rows
df.tail(3)

          0         1         2         3         4
7  0.905062 -2.190009  1.001646  0.272515  0.157264
8 -0.822407  0.169064 -0.374924  1.445999 -1.408682
9 -0.295525  0.697142  2.564100 -0.054689  0.843379

In [13]:
print("Changing column names")
cols = 'A B C D E'.split()
cols

Changing column names

['A', 'B', 'C', 'D', 'E']

In [14]:
df.columns = cols
df

          A         B         C         D         E
0  0.282845  0.777211 -0.986113 -0.970153  2.022044
1 -0.211832 -0.289286  0.850120 -0.516849 -1.400146
2 -1.414040 -0.236653  0.254347  1.165997  0.641171
3 -0.080825 -0.344345 -0.326136  2.161253 -0.655867
4  1.164650 -0.390234  0.463366  0.966196  0.716910
5  0.942322 -0.786524 -0.413173 -0.589592  0.626465
6 -0.263755 -0.391564  1.216792  0.334055 -1.286642
7  0.905062 -2.190009  1.001646  0.272515  0.157264
8 -0.822407  0.169064 -0.374924  1.445999 -1.408682
9 -0.295525  0.697142  2.564100 -0.054689  0.843379

In [16]:
pd.options.display.max_rows = 6 
df

           A         B         C         D         E
0   0.282845  0.777211 -0.986113 -0.970153  2.022044
1  -0.211832 -0.289286  0.850120 -0.516849 -1.400146
2  -1.414040 -0.236653  0.254347  1.165997  0.641171
..       ...       ...       ...       ...       ...
7   0.905062 -2.190009  1.001646  0.272515  0.157264
8  -0.822407  0.169064 -0.374924  1.445999 -1.408682
9  -0.295525  0.697142  2.564100 -0.054689  0.843379

[10 rows x 5 columns]

In [17]:
print("Getting metadata")
#10 indicate how many observation
df.info()

Getting metadata
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       10 non-null     float64
 1   B       10 non-null     float64
 2   C       10 non-null     float64
 3   D       10 non-null     float64
 4   E       10 non-null     float64
dtypes: float64(5)
memory usage: 528.0 bytes

In [18]:
index = pd.date_range('01/01/2022', periods=10)
index

DatetimeIndex(['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04',
               '2022-01-05', '2022-01-06', '2022-01-07', '2022-01-08',
               '2022-01-09', '2022-01-10'],
              dtype='datetime64[ns]', freq='D')

In [20]:
df.set_index(index, inplace=True)
#inplace=True->we don't get copy
df

                   A         B         C         D         E
2022-01-01  0.282845  0.777211 -0.986113 -0.970153  2.022044
2022-01-02 -0.211832 -0.289286  0.850120 -0.516849 -1.400146
2022-01-03 -1.414040 -0.236653  0.254347  1.165997  0.641171
...              ...       ...       ...       ...       ...
2022-01-08  0.905062 -2.190009  1.001646  0.272515  0.157264
2022-01-09 -0.822407  0.169064 -0.374924  1.445999 -1.408682
2022-01-10 -0.295525  0.697142  2.564100 -0.054689  0.843379

[10 rows x 5 columns]

In [21]:
#subsetting data
#df['A']
#df.A
df[['A','C']]

                   A         C
2022-01-01  0.282845 -0.986113
2022-01-02 -0.211832  0.850120
2022-01-03 -1.414040  0.254347
...              ...       ...
2022-01-08  0.905062  1.001646
2022-01-09 -0.822407 -0.374924
2022-01-10 -0.295525  2.564100

[10 rows x 2 columns]

In [22]:
#Accessing the values through index location(iloc)
df.iloc[0]

A    0.282845
B    0.777211
C   -0.986113
D   -0.970153
E    2.022044
Name: 2022-01-01 00:00:00, dtype: float64

In [23]:
df.iloc[0]

A    0.282845
B    0.777211
C   -0.986113
D   -0.970153
E    2.022044
Name: 2022-01-01 00:00:00, dtype: float64

In [25]:
df.iloc[[0,3,4]]

                   A         B         C         D         E
2022-01-01  0.282845  0.777211 -0.986113 -0.970153  2.022044
2022-01-04 -0.080825 -0.344345 -0.326136  2.161253 -0.655867
2022-01-05  1.164650 -0.390234  0.463366  0.966196  0.716910

In [26]:
df.iloc[0,3]

-0.9701525331394082

In [27]:
df.iloc[0,3:]

D   -0.970153
E    2.022044
Name: 2022-01-01 00:00:00, dtype: float64

In [28]:
df.loc['2022-01-01']

A    0.282845
B    0.777211
C   -0.986113
D   -0.970153
E    2.022044
Name: 2022-01-01 00:00:00, dtype: float64

In [29]:
df.loc['2022-01-01':'2022-01-04']

                   A         B         C         D         E
2022-01-01  0.282845  0.777211 -0.986113 -0.970153  2.022044
2022-01-02 -0.211832 -0.289286  0.850120 -0.516849 -1.400146
2022-01-03 -1.414040 -0.236653  0.254347  1.165997  0.641171
2022-01-04 -0.080825 -0.344345 -0.326136  2.161253 -0.655867

In [30]:
df<0

                A      B      C      D      E
2022-01-01  False  False   True   True  False
2022-01-02   True   True  False   True   True
2022-01-03   True   True  False  False  False
...           ...    ...    ...    ...    ...
2022-01-08  False   True  False  False  False
2022-01-09   True  False   True  False   True
2022-01-10   True  False  False   True  False

[10 rows x 5 columns]

In [31]:
mask = df<0
df[mask]=0
df

                   A         B         C         D         E
2022-01-01  0.282845  0.777211  0.000000  0.000000  2.022044
2022-01-02  0.000000  0.000000  0.850120  0.000000  0.000000
2022-01-03  0.000000  0.000000  0.254347  1.165997  0.641171
...              ...       ...       ...       ...       ...
2022-01-08  0.905062  0.000000  1.001646  0.272515  0.157264
2022-01-09  0.000000  0.169064  0.000000  1.445999  0.000000
2022-01-10  0.000000  0.697142  2.564100  0.000000  0.843379

[10 rows x 5 columns]

In [33]:
#Creating dataframes from dicts
pd.DataFrame({'A':range(15),'B':range(16,31)})
df2 = pd.DataFrame({'A':range(15),'B':range(16,31)})
df2

     A   B
0    0  16
1    1  17
2    2  18
..  ..  ..
12  12  28
13  13  29
14  14  30

[15 rows x 2 columns]

In [35]:
#Adding columns 
df2['C'] = df2['B'] ** 2
df2

     A   B    C
0    0  16  256
1    1  17  289
2    2  18  324
..  ..  ..  ...
12  12  28  784
13  13  29  841
14  14  30  900

[15 rows x 3 columns]

In [36]:
df2.describe()

               A          B           C
count  15.000000  15.000000   15.000000
mean    7.000000  23.000000  547.666667
std     4.472136   4.472136  206.433201
...          ...        ...         ...
50%     7.000000  23.000000  529.000000
75%    10.500000  26.500000  702.500000
max    14.000000  30.000000  900.000000

[8 rows x 3 columns]

In [37]:
df2['A'].describe()

count    15.000000
mean      7.000000
std       4.472136
           ...
50%       7.000000
75%      10.500000
max      14.000000
Name: A, Length: 8, dtype: float64

In [47]:
#Creating filters/multivalues columns
import numpy as np
import pandas as pd
data = pd.read_csv('varsha.csv')
data

  Rollno Name
0    1 Aarohi
1     2 Amyra
2      3 Neil
3    4 Nitesh